###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  ork_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[3] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-02967dda1c7a2a3ee"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[0] will be created%0A  + resource "aws_instance" "acs730gp" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = false%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-0ba99574219d86833"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Private"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Private"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[1] will be created%0A  + resource "aws_instance" "acs730gp" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = false%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-075a425987d17481c"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Private"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Private"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_key_pair.web_key will be created%0A  + resource "aws_key_pair" "web_key" {%0A      + arn             = (known after apply)%0A      + fingerprint     = (known after apply)%0A      + id              = (known after apply)%0A      + key_name        = "prod"%0A      + key_name_prefix = (known after apply)%0A      + key_pair_id     = (known after apply)%0A      + key_type        = (known after apply)%0A      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDRDRTdspsY3pfSP3apSgN8d25U+Tab9bdYNh9HKK1hOIHMUf0F2GvF47141re53O0kAMaQwU0sMu3XoGfeVkTfuHbYq1w8mJVhLby9/aYGKKLWNWkvhw3FWdUc2U1vIuHzKtcquNKBvI5m51qOWKwum8yOQHHYcmqk8jMgOyHFk5urTAqP75iT52ph063GSQYihvm4K8vKWVU/AIQC7sf0Rezejfvpcw5Pqxr364yuf7ezjkRovBffqUid5iiAxDH9SaTMBNVX0pPqPXtKANi5pOnMO08wQ1YOmIN9etFwjm9BaW7Gbj7/J+D2z5b/LpxhBIkhZ4cAZnGY/irnNAVl ec2-user@ip-172-31-85-39.ec2.internal"%0A      + tags_all        = (known after apply)%0A    }%0A%0A  # aws_security_group.web_sg will be created%0A  + resource "aws_security_group" "web_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow SSH inbound traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = ""%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "allow_ssh"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-SG-Private-nonprod"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-SG-Private-nonprod"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-00bbdff316127afad"%0A    }%0A%0A  # aws_security_group.web_sg_public will be created%0A  + resource "aws_security_group" "web_sg_public" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow HTTP and SSH inbound traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTP from everywhere"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "SSH from everywhere"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "allow_http_ssh"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-SG-Public-nonprod"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-SG-Public-nonprod"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-00bbdff316127afad"%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + web_sg_public = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*